[
  {
    "id": "1",
    "title": "Unlocking Android",
    "isbn": "1933988673",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson.jpg",
    "shortDescription": "A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout.",
    "authors": ["W. Frank Ableson", "Charlie Collins", "Robi Sen"],
    "categories": ["Open Source", "Mobile"]
  },
  {
    "id": "2",
    "title": "Android in Action, Second Edition",
    "isbn": "1935182722",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson2.jpg",
    "shortDescription": "Android in Action, Second Edition is a comprehensive tutorial for Android developers. Taking you far beyond \"Hello Android,\" this fast-paced book puts you in the driver's seat as you learn important architectural concepts and implementation strategies. You'll master the SDK, build WebKit apps using HTML 5, and even learn to extend or replace Android's built-in features by building useful and intriguing examples. ",
    "authors": ["W. Frank Ableson", "Robi Sen"],
    "categories": ["Java"]
  },
  {
    "id": "3",
    "title": "Zend Framework in Action",
    "isbn": "1933988320",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allen.jpg",
    "shortDescription": "Zend Framework in Action is a comprehensive tutorial that shows how to use the Zend Framework to create web-based applications and web services. This book takes you on an over-the-shoulder tour of the components of the Zend Framework as you build a high quality, real-world web application.",
    "authors": ["Rob Allen", "Nick Lo", "Steven Brown"],
    "categories": ["Web Development"]
  },
  {
    "id": "4",
    "title": "Flex on Java",
    "isbn": "1933988797",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allmon.jpg",
    "shortDescription": "   A beautifully written book that is a must have for every Java Developer.       Ashish Kulkarni, Technical Director, E-Business Software Solutions Ltd.",
    "authors": ["Bernerd Allmon", "Jeremy Anderson"],
    "categories": ["Internet"]
  },
  {
    "id": "5",
    "title": "Griffon in Action",
    "isbn": "1935182234",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/almiray.jpg",
    "shortDescription": "Griffon in Action is a comprehensive tutorial written for Java developers who want a more productive approach to UI development. In this book, you'll immediately dive into Griffon. After a Griffon orientation and a quick Groovy tutorial, you'll start building examples that explore Griffon's high productivity approach to Swing development. One of the troublesome parts of Swing development is the amount of Java code that is required to get a simple application off the ground.",
    "authors": ["Andres Almiray", "Danno Ferrin", "", "James Shingler"],
    "categories": ["Java"]
  },
  {
    "id": "6",
    "title": "OSGi in Depth",
    "isbn": "193518217X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alves.jpg",
    "shortDescription": "Enterprise OSGi shows a Java developer how to develop to the OSGi Service Platform Enterprise specification, an emerging Java-based technology for developing modular enterprise applications. Enterprise OSGi addresses several shortcomings of existing enterprise platforms, such as allowing the creation of better maintainable and extensible applications, and provide a simpler, easier-to-use, light-weight solution to enterprise software development.",
    "authors": ["Alexandre de Castro Alves"],
    "categories": ["Java"]
  },
  {
    "id": "7",
    "title": "Flexible Rails",
    "isbn": "1933988509",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong.jpg",
    "shortDescription": "\"Flexible Rails created a standard to which I hold other technical books. You definitely get your money's worth.\"",
    "authors": ["Peter Armstrong"],
    "categories": ["Web Development"]
  },
  {
    "id": "8",
    "title": "Hello! Flex 4",
    "isbn": "1933988762",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong3.jpg",
    "shortDescription": "Hello! Flex 4 progresses through 26 self-contained examples selected so you can progressively master Flex. They vary from small one-page apps, to a 3D rotating haiku, to a Connect Four-like game. And in the last chapter you'll learn to build a full Flex application called SocialStalkr   a mashup that lets you follow your friends by showing their tweets on a Yahoo map.",
    "authors": ["Peter Armstrong"],
    "categories": ["Internet"]
  },
  {
    "id": "9",
    "title": "Coffeehouse",
    "isbn": "1884777384",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/asher.jpg",
    "shortDescription": "Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web.",
    "authors": ["Levi Asher", "Christian Crumlish"],
    "categories": ["Miscellaneous"]
  },
  {
    "id": "10",
    "title": "Brownfield Application Development in .NET",
    "isbn": "1933988711",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/baley.jpg",
    "shortDescription": "Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.",
    "authors": ["Kyle Baley", "Donald Belcham"],
    "categories": ["Microsoft"]
  },
  {
    "id": "11",
    "title": "MongoDB in Action",
    "isbn": "1935182870",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/banker.jpg",
    "shortDescription": "MongoDB In Action is a comprehensive guide to MongoDB for application developers. The book begins by explaining what makes MongoDB unique and describing its ideal use cases. A series of tutorials designed for MongoDB mastery then leads into detailed examples for leveraging MongoDB in e-commerce, social networking, analytics, and other common applications.",
    "authors": ["Kyle Banker"],
    "categories": ["Next Generation Databases"]
  },
  {
    "id": "13",
    "title": "Hibernate in Action",
    "isbn": "193239415X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer.jpg",
    "shortDescription": "\"2005 Best Java Book!\" -- Java Developer's Journal",
    "authors": ["Christian Bauer", "Gavin King"],
    "categories": ["Java"]
  },
  {
    "id": "14",
    "title": "Java Persistence with Hibernate",
    "isbn": "1932394885",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer2.jpg",
    "shortDescription": "\"...this book is the ultimate solution. If you are going to use Hibernate in your application, you have no other choice, go rush to the store and get this book.\" --JavaLobby",
    "authors": ["Christian Bauer", "Gavin King"],
    "categories": ["Java"]
  },
  {
    "id": "16",
    "title": "Hibernate Search in Action",
    "isbn": "1933988649",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bernard.jpg",
    "shortDescription": "\"A great resource for true database independent full text search.\" --Aaron Walker, base2Services",
    "authors": ["Emmanuel Bernard", "John Griffin"],
    "categories": ["Java"]
  },
  {
    "id": "17",
    "title": "jQuery in Action",
    "isbn": "1933988355",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault.jpg",
    "shortDescription": "\"The best-thought-out and researched piece of literature on the jQuery library.\" --From the forward by John Resig, Creator of jQuery",
    "authors": ["Bear Bibeault", "Yehuda Katz"],
    "categories": ["Web Development"]
  },
  {
    "id": "18",
    "title": "jQuery in Action, Second Edition",
    "isbn": "1935182323",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault2.jpg",
    "shortDescription": "jQuery in Action, Second Edition is a fast-paced introduction to jQuery that will take your JavaScript programming to the next level. An in-depth rewrite of the bestselling first edition, this edition provides deep and practical coverage of the latest jQuery and jQuery UI releases. The book's unique \"lab pages\" anchor the explanation of each new concept in a practical example. You'll learn how to traverse HTML documents, handle events, perform animations, and add Ajax to your web pages. This comprehensive guide also teaches you how jQuery interacts with other tools and frameworks and how to build jQuery plugins. ",
    "authors": ["Bear Bibeault", "Yehuda Katz"],
    "categories": ["Java"]
  },
  {
    "id": "19",
    "title": "Building Secure and Reliable Network Applications",
    "isbn": "1884777295",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/birman.jpg",
    "shortDescription": "\"... tackles the difficult problem of building reliable distributed computing systems in a way that not only presents the principles but also describes proven practical solutions.\" --John Warne, BNR Europe",
    "authors": ["Kenneth P. Birman"],
    "categories": ["Networking", "Theory"]
  },
  {
    "id": "20",
    "title": "Ruby for Rails",
    "isbn": "1932394699",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black.jpg",
    "shortDescription": "The word is out: with Ruby on Rails you can build powerful Web applications easily and quickly! And just like the Rails framework itself, Rails applications are Ruby programs. That means you can   t tap into the full power of Rails unless you master the Ruby language.",
    "authors": ["David A. Black"],
    "categories": ["Web Development"]
  },
  {
    "id": "21",
    "title": "The Well-Grounded Rubyist",
    "isbn": "1933988657",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black2.jpg",
    "shortDescription": "What would appear to be the most complex topic of the book is in fact surprisingly easy to assimilate, and one realizes that the efforts of the author to gradually lead us to a sufficient knowledge of Ruby in order to tackle without pain the most difficult subjects, bears its fruit.       Eric Grimois, Developpez.com",
    "authors": ["David A. Black"],
    "categories": ["Programming"]
  },
  {
    "id": "22",
    "title": "Website Owner's Manual",
    "isbn": "1933988452",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/boag.jpg",
    "shortDescription": "Website Owner's Manual helps you form a vision for your site, guides you through the process of selecting a web design agency, and gives you enough background information to make intelligent decisions throughout the development process. This book provides a jargon-free overview of web design, including accessibility, usability, online marketing, and web development techniques. You'll gain a practical understanding of the technologies, processes, and ideas that drive a successful website.",
    "authors": ["Paul A. Boag"],
    "categories": ["Internet"]
  },
  {
    "id": "24",
    "title": "Hello! Python",
    "isbn": "1935182080",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/briggs.jpg",
    "shortDescription": "Hello! Python fully covers the building blocks of Python programming and gives you a gentle introduction to more advanced topics such as object oriented programming, functional programming, network programming, and program design. New (or nearly new) programmers will learn most of what they need to know to start using Python immediately.",
    "authors": ["Anthony Briggs"],
    "categories": ["Python"]
  },
  {
    "id": "25",
    "title": "iPhone in Action",
    "isbn": "193398886X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/callen.jpg",
    "shortDescription": "   There is not another iPhone title that does such a great coverage of both Web and SDK topics under one roof, thus providing a well-rounded developer education.       Vladimir Pasman, Cocoacast.com",
    "authors": ["Christopher Allen", "Shannon Appelcline"],
    "categories": ["Web Development"]
  },
  {
    "id": "26",
    "title": "Silverlight 2 in Action",
    "isbn": "1933988428",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/campbell.jpg",
    "shortDescription": "Silverlight 2 in Action gives you a solid, well-thought out and coherent foundation for building RIA web applications, and provides you with lots of technical details without ever becoming cloudy. Golo Roden, author, trainer and speaker for .NET technologies",
    "authors": ["Chad A. Campbell", "John Stockton"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "27",
    "title": "The Quick Python Book, Second Edition",
    "isbn": "193518220X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ceder.jpg",
    "shortDescription": "This revision of Manning's popular The Quick Python Book offers a clear, crisp introduction to the elegant Python programming language and its famously easy-to-read syntax. Written for programmers new to Python, this updated edition covers features common to other languages concisely, while introducing Python's comprehensive standard functions library and unique features in detail.",
    "authors": ["Naomi R. Ceder"],
    "categories": ["Python"]
  },
  {
    "id": "31",
    "title": "Hello! HTML5 & CSS3",
    "isbn": "1935182897",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crowther.jpg",
    "shortDescription": "Quick and Easy HTML5 and CSS3 is written for the web designer or developer who wants a fast, example-oriented introduction to the new HTML and CSS features. After a quick review of the basics, you'll turn to what's new. Start by learning to apply important new elements and attributes by building your first real HTML5 pages. You'll then take a quick tour through the new APIs: Form Validation, Canvas, Drag & Drop, Geolocation and Offline Applications. You'll also discover how to include video and audio on your pages without plug-ins, and how to draw interactive vector graphics with SVG.",
    "authors": ["Rob Crowther"],
    "categories": ["Internet"]
  },
  {
    "id": "32",
    "title": "Seam in Action",
    "isbn": "1933988401",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dallen.jpg",
    "shortDescription": "Seam in Action goes into great detail on the ways in which Seam helps reduce the burden of integration with different technologies such as Hibernate and JSF, allowing the developer to focus on the core business objective at hand. Shobana Jayaraman, Digital Infrastructure Analyst, University of Texas Southwestern Medical Center Library, The Tech Static",
    "authors": ["Dan Allen"],
    "categories": ["Java"]
  },
  {
    "id": "33",
    "title": "Grails in Action",
    "isbn": "1933988932",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gsmith.jpg",
    "shortDescription": "Grails in Action is a comprehensive guide to the Grails framework. First, the basics: the domain model, controllers, views, and services. Then, the fun! Dive into a Twitter-style app with features like AJAX/JSON, animation, search, wizards even messaging and Jabber integration. Along the way, you'll discover loads of great plugins that'll make your app shine. Learn to integrate with existing Java systems using Spring and Hibernate. You'll need basic familiarity with Java and the web.",
    "authors": ["Glen Smith", "Peter Ledbrook"],
    "categories": ["Java"]
  },
  {
    "id": "34",
    "title": "Up to Speed with Swing, Second Edition",
    "isbn": "1884777759",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gutz2.jpg",
    "shortDescription": "Now in its Second Edition, Up to Speed with Swing is for you if you want to get on the fast track to Java Swing. The second edition has been extensively updated to cover Java 1.2 with additional code examples and illustrations.",
    "authors": ["Steven Gutz"],
    "categories": ["Java"]
  },
  {
    "id": "36",
    "title": "SharePoint 2010 Site Owner's Manual",
    "isbn": "1933988754",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/harryman.jpg",
    "shortDescription": "SharePoint 2010 Site Owner's Manual starts by assuming you already have SharePoint installed on your system and are looking for ways to solve the problems you face every day in your organization. You'll learn to determine what type of SharePoint installation you have Microsoft Office SharePoint Server (MOSS), Windows SharePoint Services (WSS), the \"Fabulous 40\" templates and what features are at your disposal. Once you know the lay of the land, you'll discover what you can do yourself, when you need to call in some help, and when you should leave it to the developers.",
    "authors": ["Yvonne M. Harryman"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "37",
    "title": "Java Development with Ant",
    "isbn": "1930110588",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatcher.jpg",
    "shortDescription": "The most widely used build tool for Java projects, Ant is cross-platform, extensible, simple, and fast. It scales from small personal projects to large, multi-team J2EE projects. And, most important, it's easy to learn.",
    "authors": ["Erik Hatcher", "Steve Loughran"],
    "categories": ["Java", "Internet"]
  },
  {
    "id": "39",
    "title": "PowerBuilder 6.0 Questions & Answers",
    "isbn": "1884777708",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatton.jpg",
    "shortDescription": "If you'd like to learn PowerBuilder--or enhance your skills-- this book is for you. Its hands-on approach will show you how to write real code. Each section takes a specific \"How do I \" topic and answers commonly asked questions in an easy-to-understand, conversational manner. It then shows you how the same technique can be used over and over again to decrease your overall code-writing time.",
    "authors": ["Tim Hatton"],
    "categories": ["PowerBuilder"]
  },
  {
    "id": "40",
    "title": "The Awesome Power of PowerJ",
    "isbn": "1884777538",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatton2.jpg",
    "shortDescription": "The Awesome Power of PowerJ shows you how you can write Java programs the very first day with PowerJ, even if you don't know Java. Through a hands-on approach that makes liberal use of figures and code snippets, you will learn how to use PowerJ to build effective Java applets and applications.",
    "authors": ["Tim Hatton"],
    "categories": ["Java"]
  },
  {
    "id": "41",
    "title": "The Awesome Power of Power++",
    "isbn": "1884777546",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatton3.jpg",
    "shortDescription": "The Awesome Power of Power++ is for the beginning to intermediate Power++ programmer. It assumes that you have little or no knowledge of the C++ language but that you do know programming constructs. The purpose is to teach you how to use Power++ to build C++ applets and applications even if you are not a C++ expert. To this end it takes a hands-on approach and makes liberal use of figures and code snippets.",
    "authors": ["Tim Hatton"],
    "categories": ["PowerBuilder"]
  },
  {
    "id": "42",
    "title": "Azure in Action",
    "isbn": "193518248X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hay.jpg",
    "shortDescription": "Azure in Action is a fast-paced tutorial intended for architects and developers looking to develop on Windows Azure and the Windows Azure Platform. It's designed both for readers new to cloud concepts and for those familiar with cloud development but new to Azure. After a quick walk through the basics, it guides you all the way from your first app through more advanced concepts of the Windows Azure Platform.",
    "authors": ["Chris Hay", "Brian H. Prince"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "44",
    "title": "Code Generation in Action",
    "isbn": "1930110979",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/herrington.jpg",
    "shortDescription": "Code Generation In Action covers building database access, user interface, remote procedure, test cases, and business logic code as well as code for other key system functions.",
    "authors": ["Jack Herrington"],
    "categories": ["Programming"]
  },
  {
    "id": "46",
    "title": "Camel in Action",
    "isbn": "1935182366",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ibsen.jpg",
    "shortDescription": "Camel in Action is for developers working with integration of any kind. This highly practical book introduces Camel and shows examples of how to use it with the 45+ supported enterprise integration patterns. Written by the people who wrote the Camel code, it's up to date and distills details and insights that only people deeply involved with Camel could provide.",
    "authors": ["Claus Ibsen", "Jonathan Anstey"],
    "categories": ["Java"]
  },
  {
    "id": "48",
    "title": "iOS 4 in Action",
    "isbn": "1617290017",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jharrington.jpg",
    "shortDescription": "iOS 4 in Action, written for Xcode 4, is a detailed, hands-on guide that goes from setting up your development environment, through your first coding steps, all the way to creating a polished, commercial iOS 4 application. You'll run through examples from a variety of areas including a chat client, a video game, an interactive map, and background audio. You'll also learn how the new iOS 4 features apply to your existing iOS 3 based apps. This book will help you become a confident, well-rounded iOS 4 developer.",
    "authors": ["Jocelyn Harrington", "Brandon Trebitowski", "Christopher Allen", "", "Shannon Appelcline"],
    "categories": ["Mobile Technology"]
  },
  {
    "id": "49",
    "title": "Learn Windows PowerShell in a Month of Lunches",
    "isbn": "1617290211",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones.jpg",
    "shortDescription": "Learn Windows PowerShell in a Month of Lunches is an innovative tutorial designed for busy administrators. Author Don Jones has taught thousands of administrators to use PowerShell, and now he'll teach you, bringing his years of training techniques to a concise, easy-to-follow book. Just set aside one hour a day   lunchtime would be perfect   for an entire month, and you'll be automating administrative tasks faster than you ever thought possible. Don combines his own in-the-trenches experience with years of PowerShell instruction to deliver the most important, effective, and engaging elements of PowerShell to you quickly and painlessly, setting you on the path to a career-boosting future.",
    "authors": ["Don Jones"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "50",
    "title": "R in Action",
    "isbn": "1935182390",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kabacoff.jpg",
    "shortDescription": "R in Action is the first book to present both the R system and the use cases that make it such a compelling package for business developers. The book begins by introducing the R language, including the development environment. As you work through various examples illustrating R's features, you'll also get a crash course in practical statistics, including basic and advanced models for normal and non-normal data, longitudinal and survival data, and a wide variety of multivariate methods. Both data mining methodologies and approaches to messy and incomplete data are included.",
    "authors": ["Robert I. Kabacoff"],
    "categories": ["Software Engineering"]
  },
  {
    "id": "51",
    "title": "Rails 3 in Action",
    "isbn": "1935182277",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/katz.jpg",
    "shortDescription": "Rails 3 in Action will provide a thorough introduction to Ruby-based web development using Rails. Like Rails 3 itself, this book combines Merb and Rails in the form of authors Yehuda Katz, Merb Lead Developer.",
    "authors": ["Ryan Bigg", "Yehuda Katz"],
    "categories": ["Internet"]
  },
  {
    "id": "52",
    "title": "Continuous Integration in .NET",
    "isbn": "1935182552",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kawalerowicz.jpg",
    "shortDescription": "Continuous Integration in .NET is a tutorial for developers and team leads that teaches you to reimagine your development strategy by creating a consistent continuous integration process. This book shows you how to build on the tools you already know--.NET Framework and Visual Studio and to use powerful software like MSBuild, Subversion, TFS 2010, Team City, CruiseControl.NET, NUnit, and Selenium.",
    "authors": ["Marcin Kawalerowicz", "Craig Berntson"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "53",
    "title": "Technology Paradise Lost",
    "isbn": "1932394133",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/keller.jpg",
    "shortDescription": "In Technology Paradise Lost Keller describes how the new thinking is working inside some of the country's most complex and successful organizations, including Merrill Lynch, JetBlue, Harrah's, and Motorola which have cut IT spending to gain a competitive edge, and experienced marked gains to their bottom lines.",
    "authors": ["Erik Keller"],
    "categories": ["Business"]
  },
  {
    "id": "55",
    "title": "Object Technology Centers of Excellence",
    "isbn": "132612313",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/korson.jpg",
    "shortDescription": "Object Technology Centers of Excellence provides guidance to those charged with managing the shift to object technology. It is the only book on the market aimed not at the project level but at the corporate level, with a focus on the infrastructures necessary for a successful transition.",
    "authors": ["Timothy D. Korson", "Vijay K. Vaishnavi"],
    "categories": ["Object-Technology Programming", ""]
  },
  {
    "id": "56",
    "title": "Making Java Groovy",
    "isbn": "1935182943",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kousen.jpg",
    "shortDescription": "Making Java Groovy is a practical handbook for developers who want to blend Groovy into their day-to-day work with Java. It starts by introducing the key differences between Java and Groovy   and how you can use them to your advantage. Then, it guides you step-by-step through realistic development challenges, from web applications to web services to desktop applications, and shows how Groovy makes them easier to put into production.",
    "authors": ["Kenneth A. Kousen"],
    "categories": ["Java"]
  },
  {
    "id": "57",
    "title": "The Awesome Power of Direct3D/DirectX",
    "isbn": "1884777473",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kovach.jpg",
    "shortDescription": "The Awesome Power of Direct3D/DirectX shows you how to build a complete working 3D application, including 3D sound, joystick input, animation, textures, shadows, and even collision detection.",
    "authors": ["Peter J. Kovach"],
    "categories": ["Computer Graphics"]
  },
  {
    "id": "58",
    "title": "AspectJ in Action, Second Edition",
    "isbn": "1933988053",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/laddad2.jpg",
    "shortDescription": "AspectJ in Action, Second Edition is a fully updated, major revision of Ramnivas Laddad's best-selling first edition. It's a hands-on guide for Java developers. After introducing the core principles of AOP, it shows you how to create reusable solutions using AspectJ 6 and Spring 3. You'll master key features including annotation-based syntax, load-time weaver, annotation-based crosscutting, and Spring-AspectJ integration. Building on familiar technologies such as JDBC, Hibernate, JPA, Spring Security, Spring MVC, and Swing, you'll apply AOP to common problems encountered in enterprise applications.",
    "authors": ["Ramnivas Laddad"],
    "categories": ["Java"]
  },
  {
    "id": "59",
    "title": "Hadoop in Action",
    "isbn": "1935182196",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lam.jpg",
    "shortDescription": "Hadoop in Action teaches readers how to use Hadoop and write MapReduce programs. The intended readers are programmers, architects, and project managers who have to process large amounts of data offline. Hadoop in Action will lead the reader from obtaining a copy of Hadoop to setting it up in a cluster and writing data analytic programs.",
    "authors": ["Chuck Lam"],
    "categories": ["Java"]
  },
  {
    "id": "60",
    "title": "F# in Action",
    "isbn": "1935182250",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/laucher.jpg",
    "shortDescription": "F# in Action introduces the F# language, but it goes well beyond the standard tutorial and reference approach. F# expert Amanda Laucher draws on her extensive experience deploying F#-based solutions to show you how to use F# in real, day-to-day work.",
    "authors": ["Amanda Laucher"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "62",
    "title": "Client/Server Yellow Pages",
    "isbn": "1884777082",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lewis.jpg",
    "shortDescription": "This unique guide covers software products and vendors active in the client/server marketplace. Over 200 products and over 250 vendors are included.",
    "authors": ["Compiled", "introduced by Ted Lewis"],
    "categories": ["Client-Server"]
  },
  {
    "id": "63",
    "title": "Object Oriented Application Frameworks",
    "isbn": "1884777066",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lewis2.jpg",
    "shortDescription": "Frameworks are object-oriented programming environments for vertical application areas. This book is the first to survey this exciting new technology, its concepts, and practical applications.",
    "authors": ["Ted Lewis", "friends"],
    "categories": ["Object-Oriented Programming"]
  },
  {
    "id": "64",
    "title": "Erlang and OTP in Action",
    "isbn": "1933988789",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/logan.jpg",
    "shortDescription": "Erlang and OTP in Action teaches you to apply Erlang's shared-state model for concurrent programming--a completely different way of tackling the problem of parallel programming from the more common multi-threaded approach. This book walks you through the practical considerations and steps of building systems in Erlang and integrating them with real-world C/C++, Java, and .NET applications. Unlike other books on the market, Erlang and OTP in Action offers a comprehensive view of how concurrency relates to SOA and web technologies.",
    "authors": ["Martin Logan", "Eric Merritt", "", "Richard Carlsson"],
    "categories": ["Programming"]
  },
  {
    "id": "65",
    "title": "SharePoint 2007 Developer's Guide to Business Data Catalog",
    "isbn": "1933988819",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lonsdale.jpg",
    "shortDescription": "SharePoint 2007 Developer's Guide to Business Data Catalog is a practical, example-rich guide to the features of the BDC and the techniques you need to build solutions for end users. The book starts with the basics   what the BDC is, what you can do with it, and how to pull together a BDC solution. With the fundamentals in hand, it explores the techniques and ideas you need to put BDC into use effectively in your organization.",
    "authors": ["Brett Lonsdale", "Nick Swan"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "66",
    "title": "Doing IT Right",
    "isbn": "133964256",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lorin.jpg",
    "shortDescription": "Doing IT Right explores IT in its full complexity. It explains fundamental issues of hardware and software structures; it illuminates central issues of networking and encapsulates the essence of client/server computing; its coverage of costing, risk assessment, and due diligence in making computing decisions is unique.",
    "authors": ["Harold Lorin"],
    "categories": ["Business", "Software Engineering"]
  },
  {
    "id": "67",
    "title": "Ant in Action",
    "isbn": "193239480X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/loughran.jpg",
    "shortDescription": "The most widely used build tool for Java projects, Ant is cross-platform, extensible, simple, and fast. It scales from small personal projects to large, multi-team enterprise projects. And, most important, it   s easy to learn.",
    "authors": ["Steve Loughran", "Erik Hatcher"],
    "categories": ["Java"]
  },
  {
    "id": "69",
    "title": "iText in Action",
    "isbn": "1932394796",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lowagie.jpg",
    "shortDescription": "\"I've been using iText for over a year, but I still learnt an awful lot while reading this book.\" --JavaLobby",
    "authors": ["Bruno Lowagie"],
    "categories": ["Web Development"]
  },
  {
    "id": "70",
    "title": "iText in Action, Second Edition",
    "isbn": "1935182617",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lowagie2.jpg",
    "shortDescription": "iText in Action, Second Edition offers an introduction and a practical guide to iText and the internals of PDF. While at the entry level iText is easy to learn, there's an astonishing range of things you can do once you dive below the surface. This book lowers the learning curve and, though numerous innovative and practical examples, unlocks the secrets hidden in Adobe's PDF Reference. The examples are in Java but they can be easily adapted to .NET using one of iText's .NET ports: iTextSharp or iText.NET.",
    "authors": ["Bruno Lowagie"],
    "categories": ["Java"]
  },
  {
    "id": "72",
    "title": "Subversion in Action",
    "isbn": "1932394478",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/machols.jpg",
    "shortDescription": "Learn all about this new open source version control application and why it is replacing CVS as the standard. Examples demonstrate how to customize features to deal with day-to-day problems.",
    "authors": ["Jeffrey Machols"],
    "categories": ["Java"]
  },
  {
    "id": "73",
    "title": "Comprehensive Networking Glossary and Acronym Guide",
    "isbn": "013319955X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/malkin.jpg",
    "shortDescription": "This glossary offers a complete collection of technical terms and acronyms used in the networking industry.",
    "authors": ["Gary Scott Malkin"],
    "categories": ["Internet"]
  },
  {
    "id": "74",
    "title": "Internet BBSs",
    "isbn": "132869985",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mark.jpg",
    "shortDescription": "Internet BBSs: A Guided Tour provides in-depth coverage of the new world of true BBSs now available world-wide. It is a valuable resource for anyone currently using the Internet.",
    "authors": ["Richard Scott Mark"],
    "categories": ["Internet"]
  },
  {
    "id": "75",
    "title": "Inside LotusScript",
    "isbn": "1884777481",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mcginn.jpg",
    "shortDescription": "Develop Notes and Domino Web applications by providing advanced LotusScript code for direct use in your programs. This book emphasizes practical, useable code and solutions to common Notes programming problems.",
    "authors": ["Joe McGinn"],
    "categories": ["Business"]
  },
  {
    "id": "76",
    "title": "Planning and Managing ATM Networks",
    "isbn": "132621894",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/minoli.jpg",
    "shortDescription": "Planning and Managing ATM Networks covers strategic planning, initial deployment, overall management, and the day-to-day operation of ATM networks.",
    "authors": ["Daniel Minoli", "Thomas W. Golway", "", "Norris P. Smith"],
    "categories": ["Client-Server", "Networking"]
  },
  {
    "id": "77",
    "title": "Client/Server Applications on ATM Networks",
    "isbn": "137353006",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/minoli2.jpg",
    "shortDescription": "Client/Server Appliactions on ATM Networks discusses ATM as the key technology for transforming the enterprise network from data-only to an integrated data, voice, video, image and multimedia corporate infrastructure.",
    "authors": ["Daniel Minoli", "Andrew Schmidt"],
    "categories": ["Client-Server", "Networking"]
  },
  {
    "id": "79",
    "title": "ASP.NET 2.0 Web Parts in Action",
    "isbn": "193239477X",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/neimke.jpg",
    "shortDescription": "\"ASP.NET Web Parts in Action is a must read book for every developer who wants to extend his knowledge of the ASP.NET framework.\" -- Simon Busoli, DotNetSlackers.com",
    "authors": ["Darren Neimke"],
    "categories": ["Microsoft"]
  },
  {
    "id": "81",
    "title": "Core OWL 5.0",
    "isbn": "1884777503",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/neward.jpg",
    "shortDescription": "Core OWL 5.0 dives under the surface and into the OWL source code itself. You'll see what new capabilities OWL 5.0 offers the OWL programmer. You'll gain a deeper understanding of what OWL does on your behalf such as the OWL messaging system and its message maps.",
    "authors": ["Ted Neward"],
    "categories": ["Programming"]
  },
  {
    "id": "82",
    "title": "Advanced OWL 5.0",
    "isbn": "1884777465",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/neward2.jpg",
    "shortDescription": "Advanced OWL 5.0 covers advanced ways to make the OWL library do those tricky things you thought weren't possible. You'll get a long, exhaustive look at the new features introduced by the OWL 5.0 code. You'll find detailed explanations of how to extend the OWL objects themselves in new directions.",
    "authors": ["Ted Neward"],
    "categories": ["Programming"]
  },
  {
    "id": "85",
    "title": "PostGIS in Action",
    "isbn": "1935182269",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/obe.jpg",
    "shortDescription": "PostGIS in Action is the first book devoted entirely to PostGIS. It will help both new and experienced users write spatial queries to solve real-world problems. For those with experience in more traditional relational databases, this book provides a background in vector-based GIS so you can quickly move to analyzing, viewing, and mapping data.",
    "authors": ["Regina O. Obe", "Leo S. Hsu"],
    "categories": ["Internet"]
  },
  {
    "id": "86",
    "title": "Programming Mac OS X",
    "isbn": "1930110855",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/omalley.jpg",
    "shortDescription": "\"...an effective guide for Unix developers who want accurate information specifically on getting up to speed with Mac OS X and its software development environment, without having to sort through the morass of online information overload. ...If you've been a little skittish about Interface Builder, forget your worries now because the tutorial in the book is very good. ...The projects and examples are thorough and should provide even the most jaded intermediate programmer with a real taste of how challenging and satisfying it can be to code for OSX.\" - KickStartNews.com",
    "authors": ["Kevin O'Malley"],
    "categories": ["Programming"]
  },
  {
    "id": "87",
    "title": "ASP.NET MVC in Action",
    "isbn": "1933988622",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/palermo.jpg",
    "shortDescription": "ASP.NET MVC in Action is a guide to pragmatic MVC-based web development. After a thorough overview, it dives into issues of architecture and maintainability. The book assumes basic knowledge of ASP.NET (v. 3.5) and expands your expertise.",
    "authors": ["Jeffrey Palermo", "Ben Scheirman", "", "Jimmy Bogard"],
    "categories": ["Microsoft .NET"]
  },
  {
    "id": "91",
    "title": "Explorer's Guide to the Semantic Web",
    "isbn": "1932394206",
    "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/passin.jpg",
    "shortDescription": "\"A thorough look at one vision of the Web's future ...particularly well written...Highly recommended.\" -- Choice Magazine",
    "authors": ["Thomas B. Passin"],
    "categories": ["Internet", "Theory", "XML"]
  }
]
